###################################################################

# Created by write_sdc on Sun Oct 27 21:24:40 2013

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 5000
set_driving_cell -lib_cell INVX4 [get_ports clk]
set_driving_cell -lib_cell INVX4 [get_ports rst]
set_driving_cell -lib_cell INVX4 [get_ports ts_in]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[36]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[35]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[34]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[33]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[32]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[31]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[30]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[29]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[28]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[27]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[26]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[25]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[24]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[23]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[22]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[21]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[20]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[19]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[18]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[17]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[16]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[15]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[14]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[13]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[12]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[11]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[10]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[9]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[8]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[7]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[6]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[5]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[4]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[3]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[2]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[1]}]
set_driving_cell -lib_cell INVX4 [get_ports {scan_in[0]}]
set_load -pin_load 0.02 [get_ports {tas_out[7]}]
set_load -pin_load 0.02 [get_ports {tas_out[6]}]
set_load -pin_load 0.02 [get_ports {tas_out[5]}]
set_load -pin_load 0.02 [get_ports {tas_out[4]}]
set_load -pin_load 0.02 [get_ports {tas_out[3]}]
set_load -pin_load 0.02 [get_ports {tas_out[2]}]
set_load -pin_load 0.02 [get_ports {tas_out[1]}]
set_load -pin_load 0.02 [get_ports {tas_out[0]}]
set_load -pin_load 0.02 [get_ports {tcs_out[3]}]
set_load -pin_load 0.02 [get_ports {tcs_out[2]}]
set_load -pin_load 0.02 [get_ports {tcs_out[1]}]
set_load -pin_load 0.02 [get_ports {tcs_out[0]}]
set_load -pin_load 0.02 [get_ports {tds_out[7]}]
set_load -pin_load 0.02 [get_ports {tds_out[6]}]
set_load -pin_load 0.02 [get_ports {tds_out[5]}]
set_load -pin_load 0.02 [get_ports {tds_out[4]}]
set_load -pin_load 0.02 [get_ports {tds_out[3]}]
set_load -pin_load 0.02 [get_ports {tds_out[2]}]
set_load -pin_load 0.02 [get_ports {tds_out[1]}]
set_load -pin_load 0.02 [get_ports {tds_out[0]}]
set_load -pin_load 0.02 [get_ports passfail_out]
create_clock [get_ports clk]  -period 9.875  -waveform {0 4.9375}
set_input_delay -clock clk  -max 1.975  [get_ports clk]
set_input_delay -clock clk  -max 1.975  [get_ports rst]
set_input_delay -clock clk  -max 1.975  [get_ports ts_in]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[36]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[35]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[34]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[33]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[32]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[31]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[30]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[29]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[28]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[27]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[26]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[25]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[24]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[23]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[22]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[21]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[20]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[19]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[18]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[17]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[16]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[15]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[14]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[13]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[12]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[11]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[10]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[9]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[8]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[7]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[6]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[5]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[4]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[3]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[2]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[1]}]
set_input_delay -clock clk  -max 1.975  [get_ports {scan_in[0]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tas_out[7]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tas_out[6]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tas_out[5]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tas_out[4]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tas_out[3]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tas_out[2]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tas_out[1]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tas_out[0]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tcs_out[3]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tcs_out[2]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tcs_out[1]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tcs_out[0]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tds_out[7]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tds_out[6]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tds_out[5]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tds_out[4]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tds_out[3]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tds_out[2]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tds_out[1]}]
set_output_delay -clock clk  -max 0.9875  [get_ports {tds_out[0]}]
set_output_delay -clock clk  -max 0.9875  [get_ports passfail_out]
